Revit 2026 API

# ApplicationNewPointOnEdgeFaceIntersection Method

---

Construct a PointOnEdgeFaceIntersection object which is used to define the placement of a ReferencePoint given a references to edge and a reference to face.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointOnEdgeFaceIntersection NewPointOnEdgeFaceIntersection(
	Reference edgeReference,
	Reference faceReference,
	bool orientWithEdge
)
```
```vb
Public Function NewPointOnEdgeFaceIntersection (
	edgeReference As Reference,
	faceReference As Reference,
	orientWithEdge As Boolean
) As PointOnEdgeFaceIntersection
```
```cpp
public:
PointOnEdgeFaceIntersection^ NewPointOnEdgeFaceIntersection(
	Reference^ edgeReference,
	Reference^ faceReference,
	bool orientWithEdge
)
```
```fsharp
member NewPointOnEdgeFaceIntersection :
        edgeReference : Reference *
        faceReference : Reference *
        orientWithEdge : bool -> PointOnEdgeFaceIntersection
```

#### Parameters

edgeReference Reference
    The edge reference.
faceReference Reference
    The face reference.
orientWithEdge Boolean

#### Return Value

PointOnEdgeFaceIntersectionA new PointOnEdgeFaceIntersection object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument edgeReference or faceReference is . |

#### Reference

Application Class

Autodesk.Revit.Creation Namespace